GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
/*
 * Copyright (c) 2017-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wbxx.h"

#include "stm32wb_gpio.h"
#include "stm32wb_uart.h"
#include "stm32wb_dma.h"
#include "stm32wb_exti.h"
#include "stm32wb_system.h"

typedef struct _stm32wb_uart_device_t {
    stm32wb_system_notify_t   notify;
    volatile uint32_t         wakeup;
    stm32wb_uart_t * volatile instances[STM32WB_UART_INSTANCE_COUNT];
} stm32wb_uart_device_t;

static stm32wb_uart_device_t stm32wb_uart_device;

#define STM32WB_UART_OPTION_SYSCLK             0x20000000
#define STM32WB_UART_OPTION_RX_DMA             0x40000000
#define STM32WB_UART_OPTION_TX_DMA             0x80000000

#define STM32WB_UART_MODE_RX_IDLE              0x0001
#define STM32WB_UART_MODE_RX_SUSPENDED         0x0002
#define STM32WB_UART_MODE_RX_BREAK             0x0004
#define STM32WB_UART_MODE_RX_SUSPEND_REQUEST   0x0008

#define STM32WB_UART_RX_DMA_OPTION               \
    (STM32WB_DMA_OPTION_EVENT_TRANSFER_DONE |    \
     STM32WB_DMA_OPTION_EVENT_TRANSFER_HALF |    \
     STM32WB_DMA_OPTION_CIRCULAR |               \
     STM32WB_DMA_OPTION_PERIPHERAL_TO_MEMORY |   \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 | \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |     \
     STM32WB_DMA_OPTION_MEMORY_DATA_INCREMENT |  \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32WB_UART_TX_DMA_OPTION               \
    (STM32WB_DMA_OPTION_MEMORY_TO_PERIPHERAL |   \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 | \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |     \
     STM32WB_DMA_OPTION_MEMORY_DATA_INCREMENT |  \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#if (STM32WB_UART_SPI_SUPPORTED == 1)

static __attribute__((section(".dma"))) uint8_t stm32wb_uart_spi_dma_rx_none;
static __attribute__((section(".dma"))) uint8_t stm32wb_uart_spi_dma_tx_default;

#define STM32WB_UART_SPI_RX_DMA_OPTION_RECEIVE    \
    (STM32WB_DMA_OPTION_PERIPHERAL_TO_MEMORY |    \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 |  \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |      \
     STM32WB_DMA_OPTION_MEMORY_DATA_INCREMENT |   \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32WB_UART_SPI_RX_DMA_OPTION_TRANSMIT   \
    (STM32WB_DMA_OPTION_PERIPHERAL_TO_MEMORY |    \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 |  \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |      \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32WB_UART_SPI_RX_DMA_OPTION_TRANSFER   \
    (STM32WB_DMA_OPTION_PERIPHERAL_TO_MEMORY |    \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 |  \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |      \
     STM32WB_DMA_OPTION_MEMORY_DATA_INCREMENT |   \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32WB_UART_SPI_TX_DMA_OPTION_RECEIVE    \
    (STM32WB_DMA_OPTION_MEMORY_TO_PERIPHERAL |    \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 |  \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |      \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32WB_UART_SPI_TX_DMA_OPTION_TRANSMIT   \
    (STM32WB_DMA_OPTION_MEMORY_TO_PERIPHERAL |    \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 |  \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |      \
     STM32WB_DMA_OPTION_MEMORY_DATA_INCREMENT |   \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32WB_UART_SPI_TX_DMA_OPTION_TRANSFER   \
    (STM32WB_DMA_OPTION_MEMORY_TO_PERIPHERAL |    \
     STM32WB_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 |  \
     STM32WB_DMA_OPTION_MEMORY_DATA_SIZE_8 |      \
     STM32WB_DMA_OPTION_MEMORY_DATA_INCREMENT |   \
     STM32WB_DMA_OPTION_PRIORITY_MEDIUM)

#endif /* (STM32WB_UART_SPI_SUPPORTED == 1) */

static USART_TypeDef * const stm32wb_uart_xlate_USART[STM32WB_UART_INSTANCE_COUNT] = {
    USART1,
    LPUART1,
};

static const IRQn_Type stm32wb_uart_xlate_IRQn[STM32WB_UART_INSTANCE_COUNT] = {
    USART1_IRQn,
    LPUART1_IRQn,
};

static const uint32_t stm32wb_uart_xlate_IMR[STM32WB_UART_INSTANCE_COUNT] = {
    EXTI_IMR1_IM24,
    EXTI_IMR1_IM25,
};

static inline void stm32wb_uart_stop_enter(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    if (uart->option & STM32WB_UART_OPTION_RX_DMA)
    {
        USART->CR3 &= ~USART_CR3_DMAR;
    }
    
    USART->CR1 |= USART_CR1_UESM;

    USART->CR3 |= USART_CR3_WUFIE;
}

static inline void stm32wb_uart_stop_leave(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    USART->CR3 &= ~USART_CR3_WUFIE;

    if (USART->ISR & USART_ISR_WUF)
    {
        armv7m_atomic_and(&uart->mode, ~STM32WB_UART_MODE_RX_IDLE);
                            
