GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
        stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP_1);

    }

    USART->CR1 &= ~USART_CR1_UESM;

    if (uart->option & STM32WB_UART_OPTION_RX_DMA)
    {
        USART->CR3 |= USART_CR3_DMAR;
    }
}

static __attribute__((optimize("O3"))) void stm32wb_uart_notify_callback(void *context, uint32_t notify)
{
    if (notify & STM32WB_SYSTEM_NOTIFY_STOP_ENTER)
    {
        if (stm32wb_uart_device.wakeup & (1 << STM32WB_UART_INSTANCE_USART1))
        {
            stm32wb_uart_stop_enter(stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_USART1]);
        }
        
        if (stm32wb_uart_device.wakeup & (1 << STM32WB_UART_INSTANCE_LPUART1))
        {
            stm32wb_uart_stop_enter(stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_LPUART1]);
        }
    }

    if (notify & STM32WB_SYSTEM_NOTIFY_STOP_LEAVE)
    {
        if (stm32wb_uart_device.wakeup & (1 << STM32WB_UART_INSTANCE_USART1))
        {
            stm32wb_uart_stop_leave(stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_USART1]);
        }
        
        if (stm32wb_uart_device.wakeup & (1 << STM32WB_UART_INSTANCE_LPUART1))
        {
            stm32wb_uart_stop_leave(stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_LPUART1]);
        }
    }

#if (STM32WB_UART_SPI_SUPPORTED == 1)
    if (notify & STM32WB_SYSTEM_NOTIFY_CLOCKS)
    {
        if (stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_USART1])
        {
            stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_USART1]->control = ~0;
        }
    }
#endif /* (STM32WB_UART_SPI_SUPPORTED == 1) */
}

static __attribute__((noinline, optimize("O3"))) void stm32wb_uart_request(stm32wb_uart_t *uart)
{ 
    uint32_t mode, rx_count;
    
    if (uart->mode & STM32WB_UART_MODE_RX_SUSPEND_REQUEST)
    {
        mode = armv7m_atomic_and(&uart->mode, ~STM32WB_UART_MODE_RX_SUSPEND_REQUEST);
        
        rx_count = uart->rx_count;
        
        if (mode & STM32WB_UART_MODE_RX_SUSPENDED)
        {
            if (rx_count < uart->rx_threshold[1])
            {
                armv7m_atomic_and(&uart->mode, ~STM32WB_UART_MODE_RX_SUSPENDED);
                
#if (STM32WB_UART_RTS_SUPPORTED == 1)
                if (uart->option & STM32WB_UART_OPTION_RTS)
                {
                    stm32wb_gpio_pin_write(uart->pins.rts, 0);
                }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
            }
        }
        else
        {
            if (rx_count >= uart->rx_threshold[2])
            {
                armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_SUSPENDED);
                
#if (STM32WB_UART_RTS_SUPPORTED == 1)
                if (uart->option & STM32WB_UART_OPTION_RTS)
                {
                    stm32wb_gpio_pin_write(uart->pins.rts, 1);
                }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
            }
        }
    }
}

static __attribute__((noinline, optimize("O3"))) uint32_t stm32wb_uart_dma_receive(stm32wb_uart_t *uart, uint32_t rx_head)
{ 
    uint32_t mode, events, rx_tail, rx_count, rx_count_previous, rx_write;
    uint8_t rx_data;
    
    uart->rx_head = rx_head;

    events = 0;

    rx_tail = uart->rx_tail;

    if (rx_head != rx_tail)
    {
        rx_count = rx_count_previous = uart->rx_count;
        rx_write = uart->rx_write;

        do
        {
            rx_data = uart->rx_fifo[rx_tail];
            
            rx_tail++;

            if (rx_tail == uart->rx_entries)
            {
                rx_tail = 0;
            }

            mode = uart->mode & (STM32WB_UART_MODE_RX_BREAK | STM32WB_UART_MODE_RX_IDLE);
            
            if (mode)
            {
                armv7m_atomic_and(&uart->mode, ~(STM32WB_UART_MODE_RX_BREAK | STM32WB_UART_MODE_RX_IDLE));

                if (mode & STM32WB_UART_MODE_RX_IDLE)
                {
                    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP_1);
                }
                
#if (STM32WB_UART_BREAK_SUPPORTED == 1)
                if (mode & STM32WB_UART_MODE_RX_BREAK)
                {
                    events |= STM32WB_UART_EVENT_BREAK;

                    if (rx_write != uart->rx_event)
                    {
                        uart->rx_event = rx_write;
                        
                        events |= STM32WB_UART_EVENT_RECEIVE;
                    }
                    
                    (*uart->ev_callback)(uart->ev_context, events);
                    
                    events = 0;
                }
#endif /* STM32WB_UART_BREAK_SUPPORTED == 1 */
            }
            
            if (rx_count == uart->rx_size)
            {
                if (rx_count_previous < uart->rx_size)
                {
                    events |= STM32WB_UART_EVENT_OVERRUN;
                }
            }
            else
            {
                uart->rx_data[rx_write] = rx_data;
                        
                rx_write++;
                
                if (rx_write == uart->rx_size)
                {
                    rx_write = 0;
                }
                
                rx_count++;
            }
        }
        while (rx_head != rx_tail);

        uart->rx_tail = rx_tail;
        
        if (rx_count != rx_count_previous)
        {
            uart->rx_write = rx_write;
            
            if ((rx_count_previous < uart->rx_threshold[0]) && (rx_count >= uart->rx_threshold[0]))
            {
                events |= STM32WB_UART_EVENT_RECEIVE;
            }
            
            armv7m_atomic_addh(&uart->rx_count, (rx_count - rx_count_previous));

#if (STM32WB_UART_RTS_SUPPORTED == 1)
            if (uart->option & STM32WB_UART_OPTION_RTS)
            {
                if ((rx_count >= uart->rx_threshold[2]) && !(uart->mode & STM32WB_UART_MODE_RX_SUSPENDED))
                {
                    armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_SUSPEND_REQUEST);
                }
            }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
        }
    }
    
    return events;
}

static __attribute__((optimize("O3"))) void stm32wb_uart_dma_callback(void *context, uint32_t events)
{
    stm32wb_uart_t *uart = (stm32wb_uart_t *)context;
    
