GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
    events = stm32wb_uart_dma_receive(uart, stm32wb_dma_count(uart->rx_dma));
    
    if (events)
    {
        (*uart->ev_callback)(uart->ev_context, events);
    }

#if (STM32WB_UART_RTS_SUPPORTED == 1)
    if (uart->mode & STM32WB_UART_MODE_RX_SUSPEND_REQUEST)
    {
        stm32wb_uart_request(uart);
    }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
}

static __attribute__((noinline, optimize("O3"))) void stm32wb_uart_interrupt(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t events, mode, state, usart_isr, rx_count, rx_count_previous, rx_write, rx_head;
    uint8_t rx_data;
    volatile uint8_t *p_status_return;
    stm32wb_uart_done_callback_t callback;
    void *context;

    usart_isr = USART->ISR;
    
    if (usart_isr & (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE | USART_ISR_ORE | USART_ISR_IDLE | USART_ISR_RXNE))
    {
        events = 0;

        if (uart->option & STM32WB_UART_OPTION_RX_DMA)
        {
            rx_head = stm32wb_dma_count(uart->rx_dma);
            
            events |= stm32wb_uart_dma_receive(uart, rx_head);

            if (usart_isr & (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE))
            {
                USART->CR3 &= ~USART_CR3_DMAR;
                    
                USART->ICR = (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NECF);

                rx_data = USART->RDR;
            
#if (STM32WB_UART_BREAK_SUPPORTED == 1)
                if ((usart_isr & USART_ISR_FE) && (rx_data == 0x00))
                {
                    if (!(uart->mode & STM32WB_UART_MODE_RX_BREAK))
                    {
                        armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_BREAK);
                        
                        events |= STM32WB_UART_EVENT_BREAK;
                    }

                    if (!(uart->mode & STM32WB_UART_MODE_RX_IDLE))
                    {
                        armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_IDLE);

                        stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP_1);
                    }
                }
                else
#endif /* STM32WB_UART_BREAK_SUPPORTED == 1 */
                {
                    if (usart_isr & USART_ISR_FE)
                    {
                        events |= STM32WB_UART_EVENT_FRAMING;
                    }
                    
                    if (usart_isr & USART_ISR_NE)
                    {
                        events |= STM32WB_UART_EVENT_NOISE;
                    }
                    
                    if (usart_isr & USART_ISR_PE)
                    {
                        events |= STM32WB_UART_EVENT_PARITY;
                    }
                }

                USART->CR3 |= USART_CR3_DMAR;

                if (events & (STM32WB_UART_EVENT_BREAK | STM32WB_UART_EVENT_FRAMING | STM32WB_UART_EVENT_NOISE | STM32WB_UART_EVENT_PARITY))
                {
                    if (uart->rx_write != uart->rx_event)
                    {
                        uart->rx_event = uart->rx_write;
                        
                        events |= STM32WB_UART_EVENT_RECEIVE;
                    }
                    
                    (*uart->ev_callback)(uart->ev_context, events);
                    
                    events = 0;
                }
            }
        }
        else
        {
            if (usart_isr & USART_ISR_RXNE)
            {
                rx_count = rx_count_previous = uart->rx_count;
                rx_write = uart->rx_write;
                
                do
                {
                    if (usart_isr & (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE))
                    {
                        USART->ICR = (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NECF);
                        
                        rx_data = USART->RDR;
                        
                        if ((usart_isr & USART_ISR_FE) && (rx_data == 0x00))
                        {
#if (STM32WB_UART_BREAK_SUPPORTED == 1)
                            if (!(uart->mode & STM32WB_UART_MODE_RX_BREAK))
                            {
                                armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_BREAK);
                                
                                events |= STM32WB_UART_EVENT_BREAK;
                            }

                            if (!(uart->mode & STM32WB_UART_MODE_RX_IDLE))
                            {
                                armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_IDLE);
                                
                                stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP_1);
                            }
                        }
                        else
#endif /* STM32WB_UART_BREAK_SUPPORTED == 1 */
                        {
                            if (usart_isr & USART_ISR_FE)
                            {
                                events |= STM32WB_UART_EVENT_FRAMING;
                            }
                            
                            if (usart_isr & USART_ISR_NE)
                            {
                                events |= STM32WB_UART_EVENT_NOISE;
                            }
                            
                            if (usart_isr & USART_ISR_PE)
                            {
                                events |= STM32WB_UART_EVENT_PARITY;
                            }
                        }
                        
                        if (events & (STM32WB_UART_EVENT_BREAK | STM32WB_UART_EVENT_FRAMING | STM32WB_UART_EVENT_NOISE | STM32WB_UART_EVENT_PARITY))
                        {
                            if (rx_write != uart->rx_event)
                            {
                                uart->rx_event = rx_write;
                                
                                events |= STM32WB_UART_EVENT_RECEIVE;
                            }
                            
                            (*uart->ev_callback)(uart->ev_context, events);
                            
                            events = 0;
                        }
                    }
                    else
                    {
                        mode = uart->mode & (STM32WB_UART_MODE_RX_BREAK | STM32WB_UART_MODE_RX_IDLE);
            
                        if (mode)
                        {
                            armv7m_atomic_and(&uart->mode, ~(STM32WB_UART_MODE_RX_BREAK | STM32WB_UART_MODE_RX_IDLE));
                            
                            if (mode & STM32WB_UART_MODE_RX_IDLE)
                            {
                                stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP_1);
                            }
                        
#if (STM32WB_UART_BREAK_SUPPORTED == 1)
                            if (mode & STM32WB_UART_MODE_RX_BREAK)
                            {
                                events |= STM32WB_UART_EVENT_BREAK;
                            
                                if (rx_write != uart->rx_event)
                                {
                                    uart->rx_event = rx_write;
                                    
                                    events |= STM32WB_UART_EVENT_RECEIVE;
                                }
                                
