GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
                                (*uart->ev_callback)(uart->ev_context, events);
                                
                                events = 0;
                            }
#endif /* STM32WB_UART_BREAK_SUPPORTED == 1 */
                        }
                        
                        rx_data = USART->RDR;
                        
                        if (rx_count == uart->rx_size)
                        {
                            if (rx_count_previous < uart->rx_size)
                            {
                                events |= STM32WB_UART_EVENT_OVERRUN;
                            }
                        }
                        else
                        {
                            uart->rx_data[rx_write] = rx_data;
                            
                            rx_write++;
                            
                            if (rx_write == uart->rx_size)
                            {
                                rx_write = 0;
                            }
                            
                            rx_count++;
                        }
                    }
                    
                    usart_isr = USART->ISR;
                }
                while (usart_isr & USART_ISR_RXNE);
                
                if (rx_count != rx_count_previous)
                {
                    uart->rx_write = rx_write;
                    
                    if ((rx_count_previous < uart->rx_threshold[0]) && (rx_count >= uart->rx_threshold[0]))
                    {
                        events |= STM32WB_UART_EVENT_RECEIVE;
                    }
                    
                    armv7m_atomic_addh(&uart->rx_count, (rx_count - rx_count_previous));
                    
#if (STM32WB_UART_RTS_SUPPORTED == 1)
                    if (uart->option & STM32WB_UART_OPTION_RTS)
                    {
                        if ((rx_count >= uart->rx_threshold[2]) && !(uart->mode & STM32WB_UART_MODE_RX_SUSPENDED))
                        {
                            armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_SUSPEND_REQUEST);
                        }
                    }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
                }
            }
        }

        USART->ICR = USART_ICR_WUCF | USART_ICR_IDLECF | USART_ICR_ORECF;

        if (usart_isr & USART_ISR_IDLE)
        {
            if (!(uart->mode & STM32WB_UART_MODE_RX_IDLE))
            {
                armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_IDLE);

                stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP_1);

                if ((uart->rx_write != uart->rx_event) && (uart->rx_count < uart->rx_threshold[0]))
                {
                    events |= STM32WB_UART_EVENT_RECEIVE;
                }
            }
        }
        
        if (usart_isr & USART_ISR_ORE)
        {
            events |= STM32WB_UART_EVENT_OVERRUN;
        }

        if (events)
        {
            uart->rx_event = uart->rx_write;

            (*uart->ev_callback)(uart->ev_context, events);
        }
    }

#if (STM32WB_UART_RTS_SUPPORTED == 1)
    if (uart->mode & STM32WB_UART_MODE_RX_SUSPEND_REQUEST)
    {
        stm32wb_uart_request(uart);
    }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1  */

    state = uart->state;

    if (state >= STM32WB_UART_STATE_TRANSMIT_START)
    {
        if (state == STM32WB_UART_STATE_TRANSMIT_DATA)
        {
            usart_isr = USART->ISR;
            
            if (usart_isr & USART_ISR_TXE)
            {
                do
                {
                    USART->TDR = *uart->tx_data++;

                    usart_isr = USART->ISR;

                    if (uart->tx_data == uart->tx_data_e)
                    {
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
                        USART->CR3 &= ~USART_CR3_TXFTIE;
                        USART->CR1 |= USART_CR1_TCIE;
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
                        USART->CR1 = (USART->CR1 & ~USART_CR1_TXEIE) | USART_CR1_TCIE;
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */
                    
                        state = STM32WB_UART_STATE_TRANSMIT_STOP;

                        break;
                    }
                }
                while (usart_isr & USART_ISR_TXE);
            }
        }
        
        if (state == STM32WB_UART_STATE_TRANSMIT_STOP)
        {
            usart_isr = USART->ISR;

            if (usart_isr & USART_ISR_TC)
            {
                USART->CR1 &= ~USART_CR1_TCIE;

                USART->ICR = USART_ICR_TCCF;
            
                if (uart->option & STM32WB_UART_OPTION_TX_DMA)
                {
                    USART->CR3 &= ~USART_CR3_DMAT;
                
                    stm32wb_dma_stop(uart->tx_dma);
                }

                stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP_1);

                p_status_return = uart->xf_status;
                    
                armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);

                callback = uart->xf_callback;
                context = uart->xf_context;

                uart->state = STM32WB_UART_STATE_READY; 
                    
                *p_status_return = STM32WB_UART_STATUS_SUCCESS;
                    
                if (callback)
                {
                    (*callback)(context);
                }

                state = uart->state;
                
                if (state != STM32WB_UART_STATE_TRANSMIT_START)
                {
                    if (uart->option & STM32WB_UART_OPTION_TX_DMA)
                    {
                        stm32wb_dma_disable(uart->tx_dma);

                        uart->option &= ~STM32WB_UART_OPTION_TX_DMA;
                    }
                }
            }
        }

        if (state == STM32WB_UART_STATE_TRANSMIT_START)
        {
            stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP_1);

            if (uart->tx_dma != STM32WB_DMA_CHANNEL_NONE)
            {
                if (!(uart->option & STM32WB_UART_OPTION_TX_DMA))
                {
                    if (stm32wb_dma_enable(uart->tx_dma, uart->priority, NULL, NULL))
                    {
                        uart->option |= STM32WB_UART_OPTION_TX_DMA;
                    }
                }
            }
        
