GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
            if (uart->option & STM32WB_UART_OPTION_TX_DMA)
            {
                stm32wb_dma_start(uart->tx_dma, (uint32_t)&USART->TDR, (uint32_t)uart->tx_data, ((uint32_t)uart->tx_data_e - (uint32_t)uart->tx_data), STM32WB_UART_TX_DMA_OPTION);

                USART->CR3 |= USART_CR3_DMAT;
                USART->CR1 |= USART_CR1_TCIE;
            
                state = STM32WB_UART_STATE_TRANSMIT_STOP;
            }
            else
            {
                do
                {
                    USART->TDR = *uart->tx_data++;

                    usart_isr = USART->ISR;

                    if (uart->tx_data == uart->tx_data_e)
                    {
                        USART->CR1 |= USART_CR1_TCIE;
                    
                        state = STM32WB_UART_STATE_TRANSMIT_STOP;

                        break;
                    }
                }
                while (usart_isr & USART_ISR_TXE);

                if (state != STM32WB_UART_STATE_TRANSMIT_STOP)
                {
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
                    USART->CR3 |= USART_CR3_TXFTIE;
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
                    USART->CR1 |= USART_CR1_TXEIE;
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

                    state = STM32WB_UART_STATE_TRANSMIT_DATA;
                }
            }
        }
        
        if (state == STM32WB_UART_STATE_BREAK_ON)
        {
            stm32wb_gpio_pin_output(uart->pins.tx);

            p_status_return = uart->xf_status;
                
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
                
            callback = uart->xf_callback;
            context = uart->xf_context;
                
            uart->state = STM32WB_UART_STATE_BREAK; 
                
            *p_status_return = STM32WB_UART_STATUS_SUCCESS;
                
            if (callback)
            {
                (*callback)(context);
            }
            
            state = uart->state;
        }

        if (state == STM32WB_UART_STATE_BREAK_OFF)
        {
            stm32wb_gpio_pin_alternate(uart->pins.tx);

            p_status_return = uart->xf_status;
                
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
                
            callback = uart->xf_callback;
            context = uart->xf_context;
                
            uart->state = STM32WB_UART_STATE_READY; 
                
            *p_status_return = STM32WB_UART_STATUS_SUCCESS;
                
            if (callback)
            {
                (*callback)(context);
            }
            
            state = uart->state;
        }
            
        uart->state = state;
    }
}

static __attribute__((noinline, optimize("O3"))) void stm32wb_uart_start(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t uartclk;
    
    if (uart->option & STM32WB_UART_OPTION_SYSCLK)
    {
        stm32wb_system_reference(STM32WB_SYSTEM_REFERENCE_USART1 << uart->instance);

        uartclk = stm32wb_system_sysclk();
    }
    else
    {
        stm32wb_system_hsi16_enable();

        if (uart->instance == STM32WB_UART_INSTANCE_LPUART1)
        {
            uartclk = 16000000u * 256u;
        }
        else
        {
            uartclk = 16000000u;
        }
    }
    
    stm32wb_system_periph_enable(STM32WB_SYSTEM_PERIPH_USART1 + uart->instance);

    USART->CR1 = uart->cr1;
    USART->CR2 = uart->cr2;
    USART->CR3 = uart->cr3;
    USART->BRR = (uartclk + (uart->clock -1)) / uart->clock;
    USART->ICR = ~0;

    USART->CR1 |= USART_CR1_UE;

    USART->CR1 |= USART_CR1_TE;

    if (uart->option & STM32WB_UART_OPTION_WAKEUP)
    {
        if (uart->clock > 38400)
        {
            stm32wb_system_lock(STM32WB_SYSTEM_LOCK_STOP_1);
        }
        else
        {
            if (uart->instance != STM32WB_UART_INSTANCE_LPUART1)
            {
                stm32wb_system_lock(STM32WB_SYSTEM_LOCK_STOP_1);
            }
        }

        armv7m_atomic_or(&stm32wb_uart_device.wakeup, (1u << uart->instance));

        armv7m_atomic_or(&EXTI->IMR1, stm32wb_uart_xlate_IMR[uart->instance]);
    }
    
    USART->CR1 |= USART_CR1_RE;
    
    while (!(USART->ISR & USART_ISR_REACK))
    {
    }

    USART->RQR = USART_RQR_RXFRQ;

    if (uart->rx_dma != STM32WB_DMA_CHANNEL_NONE)
    {
        if (stm32wb_dma_enable(uart->rx_dma, uart->priority, stm32wb_uart_dma_callback, uart))
        {
            uart->option |= STM32WB_UART_OPTION_RX_DMA;
        }
    }

    if (uart->option & STM32WB_UART_OPTION_RX_DMA)
    {
        uart->rx_head = 0;
        uart->rx_tail = 0;

        stm32wb_dma_start(uart->rx_dma, (uint32_t)uart->rx_fifo, (uint32_t)&USART->RDR, uart->rx_entries, STM32WB_UART_RX_DMA_OPTION);
        
        USART->CR3 |= (USART_CR3_DMAR | USART_CR3_EIE);
    }
    else
    {
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
        USART->CR3 |= USART_CR3_RXFTIE;
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
        USART->CR1 |= USART_CR1_RXNEIE;
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    }
}

static __attribute__((noinline, optimize("O3"))) void stm32wb_uart_stop(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    USART->CR1 &= ~USART_CR1_TE;
    
    if (uart->option & STM32WB_UART_OPTION_RX_DMA)
    {
        stm32wb_dma_stop(uart->rx_dma);
        stm32wb_dma_disable(uart->rx_dma);
    }

    USART->CR1 &= ~USART_CR1_RE;
    
    if (uart->option & STM32WB_UART_OPTION_WAKEUP)
    {
        if (uart->clock > 38400)
        {
            stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_STOP_1);
        }
        else
        {
            if (uart->instance != STM32WB_UART_INSTANCE_LPUART1)
            {
                stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_STOP_1);
            }
        }
        
        armv7m_atomic_and(&EXTI->IMR1, ~stm32wb_uart_xlate_IMR[uart->instance]);
        
        armv7m_atomic_and(&stm32wb_uart_device.wakeup, ~(1u << uart->instance));
    }

