GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
    USART->CR1 &= ~USART_CR1_UE;
    USART->ICR = ~0;
    
    stm32wb_system_periph_disable(STM32WB_SYSTEM_PERIPH_USART1 + uart->instance);

    if (uart->option & STM32WB_UART_OPTION_SYSCLK)
    {
        stm32wb_system_unreference(STM32WB_SYSTEM_REFERENCE_USART1 << uart->instance);
    }
    else
    {
        stm32wb_system_hsi16_disable();
    }
}

bool stm32wb_uart_create(stm32wb_uart_t *uart, const stm32wb_uart_params_t *params)
{
    if (params->instance >= STM32WB_UART_INSTANCE_COUNT)
    {
        return false;
    }

    uart->USART = stm32wb_uart_xlate_USART[params->instance];
    uart->instance = params->instance;
    uart->interrupt = stm32wb_uart_xlate_IRQn[params->instance];
    uart->priority = params->priority;
    uart->rx_dma = params->rx_dma;
    uart->tx_dma = params->tx_dma;
    uart->pins = params->pins;

    uart->rx_fifo = params->rx_fifo;
    uart->rx_entries = params->rx_entries;

    uart->state = STM32WB_UART_STATE_INIT;

    if (!stm32wb_uart_device.notify.callback)
    {
#if (STM32WB_UART_SPI_SUPPORTED == 1)
        stm32wb_system_register(&stm32wb_uart_device.notify, stm32wb_uart_notify_callback, NULL, (STM32WB_SYSTEM_NOTIFY_STOP_ENTER | STM32WB_SYSTEM_NOTIFY_STOP_LEAVE | STM32WB_SYSTEM_NOTIFY_CLOCKS));
#else /* (STM32WB_UART_SPI_SUPPORTED == 1) */
        stm32wb_system_register(&stm32wb_uart_device.notify, stm32wb_uart_notify_callback, NULL, (STM32WB_SYSTEM_NOTIFY_STOP_ENTER | STM32WB_SYSTEM_NOTIFY_STOP_LEAVE));
#endif /* (STM32WB_UART_SPI_SUPPORTED == 1) */
    }

    return true;
}

bool stm32wb_uart_destroy(stm32wb_uart_t *uart)
{
    if (uart->state != STM32WB_UART_STATE_INIT)
    {
        return false;
    }

    uart->state = STM32WB_UART_STATE_NONE;

    return true;
}

bool stm32wb_uart_enable(stm32wb_uart_t *uart, uint32_t baudrate, uint32_t option, uint8_t *rx_data, uint32_t rx_size, uint32_t rx_threshold[3], stm32wb_uart_event_callback_t callback, void *context)
{
    if (uart->state != STM32WB_UART_STATE_INIT)
    {
        return false;
    }

#if 0    
    if ((rx_data == NULL) || (rx_size < 16))
    {
        return false;
    }
#endif
    
    if (armv7m_atomic_cas((volatile uint32_t*)&stm32wb_uart_device.instances[uart->instance], (uint32_t)NULL, (uint32_t)uart) != (uint32_t)NULL)
    {
        return false;
    }
    
    uart->state = STM32WB_UART_STATE_NOT_READY;
    
    armv7m_atomic_store(&uart->mode, STM32WB_UART_MODE_RX_IDLE);
    
    uart->rx_data = rx_data;
    uart->rx_size = rx_size;
    uart->rx_read = 0;
    uart->rx_write = 0;
    uart->rx_event = 0;
    armv7m_atomic_storeh(&uart->rx_count, 0);

    uart->tx_data = NULL;
    uart->tx_data_e = NULL;

    armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
    uart->xf_callback = NULL;
    uart->xf_context = NULL;

    uart->ev_callback = callback;
    uart->ev_context = context;

    if (!stm32wb_uart_configure(uart, baudrate, option, rx_threshold))
    {
        armv7m_atomic_store((volatile uint32_t*)&stm32wb_uart_device.instances[uart->instance], (uint32_t)NULL);

        uart->state = STM32WB_UART_STATE_INIT;

        return false;
    }

    uart->state = STM32WB_UART_STATE_READY;
      
    NVIC_SetPriority(uart->interrupt, uart->priority);
    NVIC_EnableIRQ(uart->interrupt);

    return true;
}

bool stm32wb_uart_disable(stm32wb_uart_t *uart)
{
    if ((uart->state != STM32WB_UART_STATE_READY) && (uart->state != STM32WB_UART_STATE_BREAK))
    {
        return false;
    }

    NVIC_DisableIRQ(uart->interrupt);

#if (STM32WB_UART_SPI_SUPPORTED == 1)
    if (!(uart->option & STM32WB_UART_OPTION_SPI))
#endif /* STM32WB_UART_SPI_SUPPORTED == 1 */
    {
        stm32wb_uart_stop(uart);
    }
    
    stm32wb_gpio_pin_configure(uart->pins.rx, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));
    stm32wb_gpio_pin_configure(uart->pins.tx, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));

#if (STM32WB_UART_RTS_SUPPORTED == 1)
    if (uart->option & STM32WB_UART_OPTION_RTS)
    {
        stm32wb_gpio_pin_configure(uart->pins.rts, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));
    }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
    
#if (STM32WB_UART_CTS_SUPPORTED == 1)
    if (uart->option & STM32WB_UART_OPTION_CTS)
    {
        stm32wb_gpio_pin_configure(uart->pins.cts, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));
    }
#endif /* STM32WB_UART_CTS_SUPPORTED == 1 */

#if (STM32WB_UART_SPI_SUPPORTED == 1)
    if (uart->option & STM32WB_UART_OPTION_SPI)
    {
        stm32wb_gpio_pin_configure(uart->pins.ck, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));
    }
#endif /* STM32WB_UART_SPI_SUPPORTED == 1 */
    
    armv7m_atomic_store((volatile uint32_t*)&stm32wb_uart_device.instances[uart->instance], (uint32_t)NULL);

    uart->state = STM32WB_UART_STATE_INIT;

    return true;
}

bool stm32wb_uart_configure(stm32wb_uart_t *uart, uint32_t baudrate, uint32_t option, uint32_t rx_threshold[3])
{
    uint32_t usart_cr1, usart_cr2, usart_cr3;

    if ((uart->state != STM32WB_UART_STATE_NOT_READY) && (uart->state != STM32WB_UART_STATE_READY))
    {
        return false;
    }
        
#if (STM32WB_UART_SPI_SUPPORTED == 1)
    if ((uart->state != STM32WB_UART_STATE_NOT_READY) && ((option ^ uart->option) & STM32WB_UART_OPTION_SPI))
    {
        return false;
    }

    if (option & STM32WB_UART_OPTION_SPI)
    {
        if (uart->instance != STM32WB_UART_INSTANCE_USART1)
        {
            return false;
        }

        if (!(stm32wb_system_options() & STM32WB_SYSTEM_OPTION_USART1_SYSCLK))
        {
            return false;
        }
        
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
        usart_cr1 = USART_CR1_OVER8 | USART_CR1_FIFOEN;
        usart_cr2 = 0;
        usart_cr3 = USART_CR3_ONEBIT | USART_CR3_TXFTCFG_1 | USART_CR3_RXFTCFG_1; /* 1/2 TXFIFO, 1/2 RXFIFO */
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
        usart_cr1 = USART_CR1_OVER8;
        usart_cr2 = 0;
        usart_cr3 = USART_CR3_ONEBIT;
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

        stm32wb_gpio_pin_configure(uart->pins.rx, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_PULLUP | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_gpio_pin_configure(uart->pins.tx, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_PULLUP | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_gpio_pin_configure(uart->pins.ck, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_PULLUP | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));

        uart->clock = 0;
        uart->option = option;
        uart->control = ~0l;
        
        uart->cr1 = usart_cr1;
        uart->cr2 = usart_cr2;
        uart->cr3 = usart_cr3;
    }
    else
#endif /* STM32WB_UART_SPI_SUPPORTED == 1 */
    {
        if ((baudrate == 0) || (baudrate > 1000000))
        {
            return false;
        }
        
