GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
        if (rx_threshold && ((rx_threshold[0] > uart->rx_size) || (rx_threshold[1] > uart->rx_size) || (rx_threshold[2] > uart->rx_size) || (rx_threshold[1] > rx_threshold[2])))
        {
            return false;
        }
        
        if (uart->state == STM32WB_UART_STATE_READY)
        {
            stm32wb_uart_stop(uart);
        }
        
        if (rx_threshold)
        {
            uart->rx_threshold[0] = rx_threshold[0];
            uart->rx_threshold[1] = rx_threshold[1];
            uart->rx_threshold[2] = rx_threshold[2];
        }
        else
        {
            uart->rx_threshold[0] = 8;
            uart->rx_threshold[1] = uart->rx_size - (uart->rx_entries ? uart->rx_entries : 8);
            uart->rx_threshold[2] = uart->rx_size - (uart->rx_entries ? uart->rx_entries : 8);
        }

        if (uart->instance == STM32WB_UART_INSTANCE_USART1)
        {
            if (stm32wb_system_options() & STM32WB_SYSTEM_OPTION_USART1_SYSCLK)
            {
                option |= STM32WB_UART_OPTION_SYSCLK;
            }
        }
        
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
        usart_cr1 = USART_CR1_FIFOEN | USART_CR1_IDLEIE;
        usart_cr2 = 0;
        usart_cr3 = USART_CR3_EIE | USART_CR3_TXFTCFG_1 | USART_CR3_RXFTCFG_1; /* 1/2 TXFIFO, 1/2 RXFIFO */
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
        usart_cr1 = USART_CR1_IDLEIE;
        usart_cr2 = 0;
        usart_cr3 = USART_CR3_EIE;
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

        if (option & (STM32WB_UART_OPTION_STOP_1_5 | STM32WB_UART_OPTION_STOP_2))
        {
            usart_cr2 |= USART_CR2_STOP_1;

            if (option & STM32WB_UART_OPTION_STOP_1_5)
            {
                usart_cr2 |= USART_CR2_STOP_0;
            }
        }
            
        if (option & (STM32WB_UART_OPTION_PARITY_EVEN | STM32WB_UART_OPTION_PARITY_ODD))
        {
            usart_cr1 |= (USART_CR1_PCE | USART_CR1_PEIE);
            
            if (option & STM32WB_UART_OPTION_PARITY_ODD)
            {
                usart_cr1 |= USART_CR1_PS;
            }
            
            usart_cr1 |= ((option & STM32WB_UART_OPTION_DATA_SIZE_8) ? USART_CR1_M0 : 0);
        }
        else
        {
            usart_cr1 |= ((option & STM32WB_UART_OPTION_DATA_SIZE_8) ? 0 : USART_CR1_M1);
        }
        
        if (option & STM32WB_UART_OPTION_WAKEUP)
        {
            usart_cr3 |= (USART_CR3_WUS_1 | USART_CR3_ONEBIT);
        }
        
        if (option & STM32WB_UART_OPTION_RX_INVERT)
        {
            usart_cr2 |= USART_CR2_RXINV;
        }
        
        if (option & STM32WB_UART_OPTION_TX_INVERT)
        {
            usart_cr2 |= USART_CR2_TXINV;
        }

        if (option & STM32WB_UART_OPTION_DATA_INVERT)
        {
            usart_cr2 |= USART_CR2_DATAINV;
        }

        stm32wb_gpio_pin_configure(uart->pins.rx, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_PUPD_PULLUP | STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_gpio_pin_configure(uart->pins.tx, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_PUPD_PULLUP | STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
        stm32wb_gpio_pin_write(uart->pins.tx, 0);
        
#if (STM32WB_UART_RTS_SUPPORTED == 1)
        if (option & STM32WB_UART_OPTION_RTS)
        {
            stm32wb_gpio_pin_configure(uart->pins.rts, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
            stm32wb_gpio_pin_write(uart->pins.rts, ((uart->mode & STM32WB_UART_MODE_RX_SUSPENDED) ? 1 : 0));
        }
        else
        {
            if (uart->option & STM32WB_UART_OPTION_RTS)
            {
                stm32wb_gpio_pin_configure(uart->pins.rts, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));
            }
        }
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
        
#if (STM32WB_UART_CTS_SUPPORTED == 1)
        if (option & STM32WB_UART_OPTION_CTS)
        {
            stm32wb_gpio_pin_configure(uart->pins.cts, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_PULLDOWN | STM32WB_GPIO_OSPEED_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
            
            usart_cr3 |= USART_CR3_CTSE;
        }
        else
        {
            if (uart->option & STM32WB_UART_OPTION_CTS)
            {
                stm32wb_gpio_pin_configure(uart->pins.cts, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_MODE_ANALOG));
            }
        }
#endif /* STM32WB_UART_CTS_SUPPORTED == 1 */
        
        if (uart->rx_dma != STM32WB_DMA_CHANNEL_NONE)
        {
            usart_cr3 |= USART_CR3_DDRE;
        }
        
        uart->clock = baudrate;
        uart->option = option;
        uart->control = ~0l;
        
        uart->cr1 = usart_cr1;
        uart->cr2 = usart_cr2;
        uart->cr3 = usart_cr3;
        
        stm32wb_uart_start(uart);
    }
    
    return true;
}

bool stm32wb_uart_break_state(stm32wb_uart_t *uart)
{
#if (STM32WB_UART_BREAK_SUPPORTED == 1)
    if (uart->state < STM32WB_UART_STATE_READY)
    {
        return false;
    }

    return !!(uart->mode & STM32WB_UART_MODE_RX_BREAK);
#else /* STM32WB_UART_BREAK_SUPPORTED == 1 */
    return false;
#endif /* STM32WB_UART_BREAK_SUPPORTED == 1 */
}

uint32_t stm32wb_uart_count(stm32wb_uart_t *uart)
{
    if (uart->state < STM32WB_UART_STATE_READY)
    {
        return 0;
    }

    return uart->rx_count;
}

uint32_t stm32wb_uart_read(stm32wb_uart_t *uart, uint8_t *rx_data, uint32_t rx_count)
{
    uint32_t rx_size, rx_read;
    uint32_t rx_count_previous;

    if (uart->state < STM32WB_UART_STATE_READY)
    {
        return 0;
    }

    rx_size = uart->rx_count;

    if (rx_count > rx_size)
    {
        rx_count = rx_size;
    }

    if (rx_count)
    {
        rx_read = uart->rx_read;
        rx_size = rx_count;

        if ((rx_read + rx_size) > uart->rx_size)
        {
            rx_size = uart->rx_size - rx_read;
        }

        memcpy(rx_data, &uart->rx_data[rx_read], rx_size);

        rx_data += rx_size;
        rx_read += rx_size;

        if (rx_read == uart->rx_size)
        {
            rx_read = 0;
        }

