GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
        if (rx_count != rx_size)
        {
            rx_size = rx_count - rx_size;

            memcpy(rx_data, &uart->rx_data[rx_read], rx_size);

            rx_data += rx_size;
            rx_read += rx_size;
        }

        uart->rx_read = rx_read;

#if (STM32WB_UART_RTS_SUPPORTED == 1)
        rx_count_previous = armv7m_atomic_subh(&uart->rx_count, rx_count);

        if (uart->option & STM32WB_UART_OPTION_RTS)
        {
            if (((rx_count_previous - rx_count) < uart->rx_threshold[1]) && (uart->mode & STM32WB_UART_MODE_RX_SUSPENDED))
            {
                armv7m_atomic_or(&uart->mode, STM32WB_UART_MODE_RX_SUSPEND_REQUEST);
                
                if (__current_irq() != uart->interrupt)
                {
                    NVIC_SetPendingIRQ(uart->interrupt);
                }
            }
        }
#else /* STM32WB_UART_RTS_SUPPORTED == 1 */
        armv7m_atomic_subh(&uart->rx_count, rx_count);
#endif /* STM32WB_UART_RTS_SUPPORTED == 1 */
    }
    
    return rx_count;
}

int32_t stm32wb_uart_peek(stm32wb_uart_t *uart)
{
    if (uart->state < STM32WB_UART_STATE_READY)
    {
        return -1;
    }

    if (uart->rx_count == 0)
    {
        return -1;
    }

    return uart->rx_data[uart->rx_read];
}

bool stm32wb_uart_transmit(stm32wb_uart_t *uart, const uint8_t *tx_data, uint32_t tx_count, volatile uint8_t *p_status_return, stm32wb_uart_done_callback_t callback, void *context)
{
    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL, (uint32_t)p_status_return) != (uint32_t)NULL)
    {
        return false;
    }

    if (uart->state != STM32WB_UART_STATE_READY)
    {
        armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);

        return false;
    }

    *p_status_return = STM32WB_UART_STATUS_BUSY;
    
    uart->xf_callback = callback;
    uart->xf_context = context;

    uart->tx_data = tx_data;
    uart->tx_data_e = tx_data + tx_count;

    uart->state = STM32WB_UART_STATE_TRANSMIT_START;

    if (__current_irq() != uart->interrupt)
    {
        NVIC_SetPendingIRQ(uart->interrupt);
    }

    return true;
}

bool stm32wb_uart_break(stm32wb_uart_t *uart, bool onoff, volatile uint8_t *p_status_return, stm32wb_uart_done_callback_t callback, void *context)
{
    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL, (uint32_t)p_status_return) != (uint32_t)NULL)
    {
        return false;
    }

    if (uart->state != (onoff ? STM32WB_UART_STATE_READY : STM32WB_UART_STATE_BREAK))
    {
        armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);

        return false;
    }

    *p_status_return = STM32WB_UART_STATUS_BUSY;
    
    uart->xf_callback = callback;
    uart->xf_context = context;

    uart->state = (onoff ? STM32WB_UART_STATE_BREAK_ON : STM32WB_UART_STATE_BREAK_OFF);

    if (__current_irq() != uart->interrupt)
    {
        NVIC_SetPendingIRQ(uart->interrupt);
    }

    return true;
}

#if (STM32WB_UART_SPI_SUPPORTED == 1)

#include "stm32wb_spi.h"

static inline __attribute__((optimize("O3"),always_inline)) uint8_t STM32WB_UART_SPI_READ_8(USART_TypeDef *USART)
{
    return *((volatile uint8_t*)(&USART->RDR));
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_UART_SPI_WRITE_8(USART_TypeDef *USART, uint8_t data)
{
    *((volatile uint8_t*)(&USART->TDR)) = data;
}
  
static inline __attribute__((optimize("O3"),always_inline)) uint8_t STM32WB_UART_SPI_DATA_8(USART_TypeDef *USART, uint8_t data)
{
    STM32WB_UART_SPI_WRITE_8(USART, data);

#if (STM32WB_UART_FIFO_SUPPORTED == 1)
    while (!(USART->ISR & USART_ISR_RXFNE))
    {
    }
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    while (!(USART->ISR & USART_ISR_RXNE))
    {
    }
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    return STM32WB_UART_SPI_READ_8(USART);
}

static void stm32wb_uart_spi_dma_callback(stm32wb_uart_t *uart, uint32_t events)
{
    USART_TypeDef *USART = uart->USART;
    stm32wb_uart_done_callback_t callback;
    void *context;
    volatile uint8_t *p_status_return;

    p_status_return = uart->xf_status;

    if (!p_status_return)
    {
        return;
    }

    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)p_status_return, (uint32_t)NULL) != (uint32_t)p_status_return)
    {
        return;
    }

    stm32wb_dma_stop(uart->tx_dma);
    stm32wb_dma_stop(uart->rx_dma);

    USART->CR3 = uart->cr3;

    callback = uart->xf_callback;
    context = uart->xf_context;

    uart->state = STM32WB_UART_STATE_DATA;
    
    *p_status_return = STM32WB_UART_STATUS_SUCCESS;

    if (callback)
    {
        (*callback)(context);
    }
}

bool stm32wb_uart_spi_enable(stm32wb_uart_t *uart)
{
    return stm32wb_uart_enable(uart, 0, STM32WB_UART_OPTION_SPI, NULL, 0, NULL, NULL, NULL);
}

bool stm32wb_uart_spi_disable(stm32wb_uart_t *uart)
{
    return stm32wb_uart_disable(uart);
}

bool stm32wb_uart_spi_block(stm32wb_uart_t *uart, uint16_t pin)
{
    if (uart->state != STM32WB_UART_STATE_READY)
    {
        return false;
    }

    uart->mask |= (1ul << ((pin & STM32WB_GPIO_PIN_INDEX_MASK) >> STM32WB_GPIO_PIN_INDEX_SHIFT));

    return true;
}

bool stm32wb_uart_spi_unblock(stm32wb_uart_t *uart, uint16_t pin)
{
    if (uart->state != STM32WB_UART_STATE_READY)
    {
        return false;
    }

    uart->mask &= ~(1ul << ((pin & STM32WB_GPIO_PIN_INDEX_MASK) >> STM32WB_GPIO_PIN_INDEX_SHIFT));

    return true;
}

bool stm32wb_uart_spi_acquire(stm32wb_uart_t *uart, uint32_t clock, uint32_t control)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t uartclk, uartdiv;

    if (uart->state != STM32WB_UART_STATE_READY)
    {
        return false;
    }

    if (!(uart->option & STM32WB_UART_OPTION_SPI))
    {
        return false;
    }
    
    if (uart->mask)
    {
        stm32wb_exti_block(uart->mask);
    }

    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP_0);
    stm32wb_system_reference(STM32WB_SYSTEM_REFERENCE_USART1 << uart->instance);

