GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
    stm32wb_system_periph_enable(STM32WB_SYSTEM_PERIPH_USART1 + uart->instance);

    if ((uart->clock != clock) || (uart->control != control))
    {
        uartclk = stm32wb_system_sysclk();

        uartdiv = ((uartclk + (clock -1)) / clock) * 2;

        if (uartdiv < 16)
        {
            uartdiv = 16;
        }

        uart->cr2 = ((USART_CR2_CLKEN | USART_CR2_LBCL) |
                     ((control & STM32WB_UART_SPI_CONTROL_LSB_FIRST) ? 0 : USART_CR2_MSBFIRST) |
                     ((control & STM32WB_UART_SPI_CONTROL_CPOL) ? USART_CR2_CPOL : 0) |
                     ((control & STM32WB_UART_SPI_CONTROL_CPHA) ? USART_CR2_CPHA : 0));


        USART->CR1 = uart->cr1;
        USART->CR2 = uart->cr2;
        USART->CR3 = uart->cr3;
        USART->BRR = (uartdiv & ~15) | ((uartdiv & 15) >> 1);
        
        uart->clock = clock;
        uart->control = control;
    }

    USART->CR1 = uart->cr1 | USART_CR1_UE;
    USART->CR1 = uart->cr1 | USART_CR1_UE | USART_CR1_TE | USART_CR1_RE;
    
    while (!(USART->ISR & USART_ISR_REACK))
    {
    }

    USART->RQR = USART_RQR_RXFRQ;

    uart->state = STM32WB_UART_STATE_DATA;

    return true;
}

bool stm32wb_uart_spi_release(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    if (uart->state != STM32WB_UART_STATE_DATA)
    {
        return false;
    }
    
    USART->CR1 = uart->cr1 | USART_CR1_UE;
    USART->CR1 = uart->cr1;

    if (uart->option & (STM32WB_UART_OPTION_RX_DMA | STM32WB_UART_OPTION_TX_DMA))
    {
        if (uart->option & STM32WB_UART_OPTION_RX_DMA)
        {
            stm32wb_dma_disable(uart->rx_dma);
        }

        if (uart->option & STM32WB_UART_OPTION_TX_DMA)
        {
            stm32wb_dma_disable(uart->tx_dma);
        }
        
        uart->option &= ~(STM32WB_UART_OPTION_RX_DMA | STM32WB_UART_OPTION_TX_DMA);
    }

    stm32wb_system_periph_disable(STM32WB_SYSTEM_PERIPH_USART1 + uart->instance);

    stm32wb_system_unreference(STM32WB_SYSTEM_REFERENCE_USART1 << uart->instance);
    stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP_0);

    uart->state = STM32WB_UART_STATE_READY;

    if (uart->mask)
    {
        stm32wb_exti_unblock(uart->mask, false);
    }

    return true;
}

__attribute__((optimize("O3"))) uint8_t stm32wb_uart_spi_data(stm32wb_uart_t *uart, uint8_t tx_data)
{
    USART_TypeDef *USART = uart->USART;
    uint8_t rx_data;

    rx_data = STM32WB_UART_SPI_DATA_8(USART, tx_data);

    return rx_data;
}

uint16_t stm32wb_uart_spi_data16le(stm32wb_uart_t *uart, uint16_t tx_data)
{
    USART_TypeDef *USART = uart->USART;
    uint16_t rx_data;
    
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
    STM32WB_UART_SPI_WRITE_8(USART, tx_data >> 0);
    STM32WB_UART_SPI_WRITE_8(USART, tx_data >> 8);

    while (!(USART->ISR & USART_ISR_RXFNE))
    {
    }

    rx_data = (STM32WB_UART_SPI_READ_8(USART) << 0);

    while (!(USART->ISR & USART_ISR_RXFNE))
    {
    }

    rx_data |= (STM32WB_UART_SPI_READ_8(USART) << 8);
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    rx_data = (STM32WB_UART_SPI_DATA_8(USART, tx_data >> 0) << 0);
    rx_data |= (STM32WB_UART_SPI_DATA_8(USART, tx_data >> 8) << 8);
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    return rx_data;
}

uint16_t stm32wb_uart_spi_data16be(stm32wb_uart_t *uart, uint16_t tx_data)
{
    USART_TypeDef *USART = uart->USART;
    uint16_t rx_data;

#if (STM32WB_UART_FIFO_SUPPORTED == 1)
    STM32WB_UART_SPI_WRITE_8(USART, tx_data >> 8);
    STM32WB_UART_SPI_WRITE_8(USART, tx_data >> 0);

    while (!(USART->ISR & USART_ISR_RXFNE))
    {
    }

    rx_data = (STM32WB_UART_SPI_READ_8(USART) << 8);

    while (!(USART->ISR & USART_ISR_RXFNE))
    {
    }

    rx_data |= (STM32WB_UART_SPI_READ_8(USART) << 0);
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    rx_data = (STM32WB_UART_SPI_DATA_8(USART, tx_data >> 8) << 8);
    rx_data |= (STM32WB_UART_SPI_DATA_8(USART, tx_data >> 0) << 0);
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    return rx_data;
}

void stm32wb_uart_spi_data_receive(stm32wb_uart_t *uart, uint8_t *rx_data, uint32_t rx_count)
{
    USART_TypeDef *USART = uart->USART;
    uint8_t *rx_data_e;
    const uint8_t tx_default = 0xff;
    
#if (STM32WB_UART_FIFO_SUPPORTED == 1)

    if (rx_count < 4)
    {
        if (rx_count == 3)
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
            
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
            
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            rx_data[1] = STM32WB_UART_SPI_READ_8(USART);

            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            rx_data[2] = STM32WB_UART_SPI_READ_8(USART);
        }
        else if (rx_count == 2)
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
            
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
            
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            rx_data[1] = STM32WB_UART_SPI_READ_8(USART);
        }
        else
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
            
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
        }
    }
    else
    {
        rx_data_e = rx_data + rx_count - 4;
        
        STM32WB_UART_SPI_WRITE_8(USART, tx_default);
        STM32WB_UART_SPI_WRITE_8(USART, tx_default);
        STM32WB_UART_SPI_WRITE_8(USART, tx_default);
        STM32WB_UART_SPI_WRITE_8(USART, tx_default);
        
        while (rx_data != rx_data_e)
        {
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }
            
            *rx_data++ = STM32WB_UART_SPI_READ_8(USART);
            
            STM32WB_UART_SPI_WRITE_8(USART, tx_default);
        }
        
