GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }
        
        rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
        
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }
        
        rx_data[1] = STM32WB_UART_SPI_READ_8(USART);
        
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }
        
        rx_data[2] = STM32WB_UART_SPI_READ_8(USART);

        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }
        
        rx_data[3] = STM32WB_UART_SPI_READ_8(USART);
    }

#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    rx_data_e = rx_data + rx_count;

    while (rx_data != rx_data_e)
    {
        *rx_data++ = STM32WB_UART_SPI_DATA_8(USART, tx_default);
    }

#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */
}

void stm32wb_uart_spi_data_transmit(stm32wb_uart_t *uart, const uint8_t *tx_data, uint32_t tx_count)
{
    USART_TypeDef *USART = uart->USART;
    const uint8_t *tx_data_e;

#if (STM32WB_UART_FIFO_SUPPORTED == 1)

    if (tx_count < 4)
    {
        if (tx_count == 3)
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[1]);
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[2]);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);

            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);
        }
        else if (tx_count == 2)
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[1]);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);
        }
        else
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);
        }
    }
    else
    {
        tx_data_e = tx_data + tx_count;
        
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[1]);
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[2]);
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[3]);
        tx_data += 4;
                
        while (tx_data != tx_data_e)
        {
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            STM32WB_UART_SPI_READ_8(USART);
            STM32WB_UART_SPI_WRITE_8(USART, *tx_data++);
        }
                
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        STM32WB_UART_SPI_READ_8(USART);
                
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        STM32WB_UART_SPI_READ_8(USART);
                
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        STM32WB_UART_SPI_READ_8(USART);

        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        STM32WB_UART_SPI_READ_8(USART);
    }

#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    tx_data_e = tx_data + tx_count;

    while (tx_data != tx_data_e)
    {
        STM32WB_UART_SPI_DATA_8(USART, *tx_data++);
    }

#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */
}

void stm32wb_uart_spi_data_transfer(stm32wb_uart_t *uart, const uint8_t *tx_data, uint8_t *rx_data, uint32_t xf_count)
{
    USART_TypeDef *USART = uart->USART;
    const uint8_t *tx_data_e;

#if (STM32WB_UART_FIFO_SUPPORTED == 1)

    if (xf_count < 4)
    {
        if (xf_count == 3)
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[1]);
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[2]);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            rx_data[1] = STM32WB_UART_SPI_READ_8(USART);

            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            rx_data[2] = STM32WB_UART_SPI_READ_8(USART);
        }
        else if (xf_count == 2)
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[1]);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            rx_data[1] = STM32WB_UART_SPI_READ_8(USART);
        }
        else
        {
            STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
                    
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
        }
    }
    else
    {
        tx_data_e = tx_data + xf_count;
        
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[0]);
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[1]);
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[2]);
        STM32WB_UART_SPI_WRITE_8(USART, tx_data[3]);
        tx_data += 4;

        while (tx_data != tx_data_e)
        {
            while (!(USART->ISR & USART_ISR_RXFNE))
            {
            }

            *rx_data++ = STM32WB_UART_SPI_READ_8(USART);
            STM32WB_UART_SPI_WRITE_8(USART, *tx_data++);
        }
                
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        rx_data[0] = STM32WB_UART_SPI_READ_8(USART);
                
