GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        rx_data[1] = STM32WB_UART_SPI_READ_8(USART);
                
        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        rx_data[2] = STM32WB_UART_SPI_READ_8(USART);

        while (!(USART->ISR & USART_ISR_RXFNE))
        {
        }

        rx_data[3] = STM32WB_UART_SPI_READ_8(USART);
    }

#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    tx_data_e = tx_data + xf_count;

    while (tx_data != tx_data_e)
    {
        *rx_data++ = STM32WB_UART_SPI_DATA_8(USART, *tx_data++);
    }

#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */
}

__attribute__((optimize("O3"))) bool stm32wb_uart_spi_data_dma_receive(stm32wb_uart_t *uart, uint8_t *rx_data, uint32_t rx_count, volatile uint8_t *p_status_return, stm32wb_uart_done_callback_t callback, void *context)
{
    USART_TypeDef *USART = uart->USART;

    if (uart->state != STM32WB_UART_STATE_DATA)
    {
        return false;
    }

    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL, (uint32_t)p_status_return) != (uint32_t)NULL)
    {
        return false;
    }

    if (!(uart->option & STM32WB_UART_OPTION_RX_DMA))
    {
        if (!stm32wb_dma_enable(uart->rx_dma, uart->priority, (stm32wb_dma_callback_t)stm32wb_uart_spi_dma_callback, uart))
        {
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
            
            return false;
        }
        
        uart->option |= STM32WB_UART_OPTION_RX_DMA;
    }
    
    if (!(uart->option & STM32WB_UART_OPTION_TX_DMA))
    {
        if (!stm32wb_dma_enable(uart->tx_dma, uart->priority, NULL, NULL))
        {
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
            
            return false;
        }
        
        uart->option |= STM32WB_UART_OPTION_TX_DMA;
    }

    uart->state = STM32WB_UART_STATE_DATA_DMA;
    
    *p_status_return = STM32WB_UART_STATUS_BUSY;
    
    uart->xf_status = p_status_return;
    uart->xf_callback = callback;
    uart->xf_context = context;
    uart->rx_data = rx_data;

    USART->CR3 = uart->cr3 | (USART_CR3_DMAR | USART_CR3_DMAT);

    stm32wb_dma_start(uart->rx_dma, (uint32_t)rx_data, (uint32_t)&USART->RDR, rx_count, STM32WB_UART_SPI_RX_DMA_OPTION_RECEIVE | STM32WB_DMA_OPTION_EVENT_TRANSFER_DONE);
    stm32wb_dma_start(uart->tx_dma, (uint32_t)&USART->TDR, (uint32_t)&stm32wb_uart_spi_dma_tx_default, rx_count, STM32WB_UART_SPI_TX_DMA_OPTION_RECEIVE);
        
    return true;
}

__attribute__((optimize("O3"))) bool stm32wb_uart_spi_data_dma_transmit(stm32wb_uart_t *uart, const uint8_t *tx_data, uint32_t tx_count, volatile uint8_t *p_status_return, stm32wb_uart_done_callback_t callback, void *context)
{
    USART_TypeDef *USART = uart->USART;
    
    if (uart->state != STM32WB_UART_STATE_DATA)
    {
        return false;
    }

    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL, (uint32_t)p_status_return) != (uint32_t)NULL)
    {
        return false;
    }

    if (!(uart->option & STM32WB_UART_OPTION_RX_DMA))
    {
        if (!stm32wb_dma_enable(uart->rx_dma, uart->priority, (stm32wb_dma_callback_t)stm32wb_uart_spi_dma_callback, uart))
        {
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
            
            return false;
        }
        
        uart->option |= STM32WB_UART_OPTION_RX_DMA;
    }
    
    if (!(uart->option & STM32WB_UART_OPTION_TX_DMA))
    {
        if (!stm32wb_dma_enable(uart->tx_dma, uart->priority, NULL, NULL))
        {
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
            
            return false;
        }
        
        uart->option |= STM32WB_UART_OPTION_TX_DMA;
    }

    uart->state = STM32WB_UART_STATE_DATA_DMA;
    
    *p_status_return = STM32WB_UART_STATUS_BUSY;

    uart->xf_status = p_status_return;
    uart->xf_callback = callback;
    uart->xf_context = context;
    uart->rx_data = NULL;

    USART->CR3 = uart->cr3 | (USART_CR3_DMAR | USART_CR3_DMAT);
                
    stm32wb_dma_start(uart->rx_dma, (uint32_t)&stm32wb_uart_spi_dma_rx_none, (uint32_t)&USART->RDR, tx_count, STM32WB_UART_SPI_RX_DMA_OPTION_RECEIVE | STM32WB_DMA_OPTION_EVENT_TRANSFER_DONE);
    stm32wb_dma_start(uart->tx_dma, (uint32_t)&USART->TDR, (uint32_t)tx_data, tx_count, STM32WB_UART_SPI_TX_DMA_OPTION_RECEIVE);

    return true;
}

__attribute__((optimize("O3"))) bool stm32wb_uart_spi_data_dma_transfer(stm32wb_uart_t *uart, const uint8_t *tx_data, uint8_t *rx_data, uint32_t xf_count, volatile uint8_t *p_status_return, stm32wb_uart_done_callback_t callback, void *context)
{
    USART_TypeDef *USART = uart->USART;
    
    if (uart->state != STM32WB_UART_STATE_DATA)
    {
        return false;
    }

    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL, (uint32_t)p_status_return) != (uint32_t)NULL)
    {
        return false;
    }

    if (!(uart->option & STM32WB_UART_OPTION_RX_DMA))
    {
        if (!stm32wb_dma_enable(uart->rx_dma, uart->priority, (stm32wb_dma_callback_t)stm32wb_uart_spi_dma_callback, uart))
        {
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
            
            return false;
        }
        
        uart->option |= STM32WB_UART_OPTION_RX_DMA;
    }
    
    if (!(uart->option & STM32WB_UART_OPTION_TX_DMA))
    {
        if (!stm32wb_dma_enable(uart->tx_dma, uart->priority, NULL, NULL))
        {
            armv7m_atomic_store((volatile uint32_t*)&uart->xf_status, (uint32_t)NULL);
            
            return false;
        }
        
        uart->option |= STM32WB_UART_OPTION_TX_DMA;
    }

    uart->state = STM32WB_UART_STATE_DATA_DMA;
    
    *p_status_return = STM32WB_UART_STATUS_BUSY;

    uart->xf_status = p_status_return;
    uart->xf_callback = callback;
    uart->xf_context = context;

    uart->rx_data = rx_data;

    USART->CR3 = uart->cr3 | (USART_CR3_DMAR | USART_CR3_DMAT);

    stm32wb_dma_start(uart->rx_dma, (uint32_t)rx_data, (uint32_t)&USART->RDR, xf_count, STM32WB_UART_SPI_RX_DMA_OPTION_TRANSFER | STM32WB_DMA_OPTION_EVENT_TRANSFER_DONE);
    stm32wb_dma_start(uart->tx_dma, (uint32_t)&USART->TDR, (uint32_t)tx_data, xf_count, STM32WB_UART_SPI_TX_DMA_OPTION_TRANSFER);

