GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_uart.c
    return true;
}

uint32_t stm32wb_uart_spi_data_dma_cancel(stm32wb_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t xf_count;
    volatile uint8_t *p_status_return;

    p_status_return = uart->xf_status;

    if (!p_status_return)
    {
        return 0;
    }

    if (armv7m_atomic_cas((volatile uint32_t*)&uart->xf_status, (uint32_t)p_status_return, (uint32_t)NULL) != (uint32_t)p_status_return)
    {
        return 0;
    }

    stm32wb_dma_stop(uart->tx_dma);

    USART->CR3 = uart->cr3 | USART_CR3_DMAR;
    
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
    while ((USART->ISR & (USART_ISR_TXFE | USART_ISR_TC)) != (USART_ISR_TXFE | USART_ISR_TC))
    {
    }
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    while ((USART->ISR & (USART_ISR_TXE | USART_ISR_TC)) != (USART_ISR_TXE | USART_ISR_TC))
    {
    }
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    
    xf_count = stm32wb_dma_stop(uart->rx_dma);

    USART->CR3 = uart->cr3;
    
#if (STM32WB_UART_FIFO_SUPPORTED == 1)
    if (uart->rx_data)
    {
        while (USART->ISR & USART_ISR_RXFNE)
        {
            uart->rx_data[xf_count++] = STM32WB_UART_SPI_READ_8(USART);
        }
    }
    else
    {
        while (USART->ISR & USART_ISR_RXFNE)
        {
            STM32WB_UART_SPI_READ_8(USART);
        }
    }
#else /* STM32WB_UART_FIFO_SUPPORTED == 1 */
    if (uart->rx_data)
    {
        if (USART->ISR & USART_ISR_RXNE)
        {
            uart->rx_data[xf_count++] = STM32WB_UART_SPI_READ_8(USART);
        }
    }
    else
    {
        if (USART->ISR & USART_ISR_RXNE)
        {
            STM32WB_UART_SPI_READ_8(USART);
        }
    }
#endif /* STM32WB_UART_FIFO_SUPPORTED == 1 */

    uart->state = STM32WB_UART_STATE_DATA;
    
    *p_status_return = STM32WB_UART_STATUS_FAILURE;
    
    return xf_count;
}

bool stm32wb_uart_spi_data_dma_busy(stm32wb_uart_t *uart)
{
    return (uart->state == STM32WB_UART_STATE_DATA_DMA);
}

#endif /* (STM32WB_UART_UART_SUPPORTED == 1) */

void USART1_IRQHandler(void)
{
    stm32wb_uart_interrupt(stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_USART1]);

    __DSB();
}

void LPUART1_IRQHandler(void)
{
    stm32wb_uart_interrupt(stm32wb_uart_device.instances[STM32WB_UART_INSTANCE_LPUART1]);

    __DSB();
}
